let scheduleData = {
    "30/09/2024": [
        { time: "9:00-10:30", subject: "", room: "" },
        { time: "10:40-12:10", subject: "", room: "" },
        { time: "13:20-14:50", subject: "Математический анализ", room: "2С3" },
        { time: "15:00-16:30", subject: "Математический анализ", room: "2С3" },
        { time: "16:40-18:10", subject: "", room: "" }
    ],
    "01/10/2024": [
        { time: "9:00-10:30", subject: "", room: "" },
        { time: "10:40-12:10", subject: "Физкультура", room: "" },
        { time: "13:20-14:50", subject: "Математический анализ", room: "2А5" },
        { time: "15:00-16:30", subject: "Математический анализ", room: "2А5" },
        { time: "16:40-18:10", subject: "", room: "" }
    ],
    "02/10/2024": [
        { time: "9:00-10:30", subject: "", room: "" },
        { time: "10:40-12:10", subject: "", room: "" },
        { time: "13:20-14:50", subject: "Математический анализ", room: "2А5" },
        { time: "15:00-16:30", subject: "Математический анализ", room: "2А5" },
        { time: "16:40-18:10", subject: "", room: "" }
    ],
    "03/10/2024": [
        { time: "9:00-10:30", subject: "", room: "" },
        { time: "10:40-12:10", subject: "Физкультура", room: "" },
        { time: "13:20-14:50", subject: "Математический анализ", room: "2А5" },
        { time: "15:00-16:30", subject: "Математический анализ", room: "2А5" },
        { time: "16:40-18:10", subject: "", room: "" }
    ],
    "04/10/2024": [
        { time: "9:00-10:30", subject: "", room: "" },
        { time: "10:40-12:10", subject: "", room: "" },
        { time: "13:20-14:50", subject: "Математический анализ", room: "2А5" },
        { time: "15:00-16:30", subject: "Математический анализ", room: "2А5" },
        { time: "16:40-18:10", subject: "", room: "" }
    ],
    "05/10/2024": [
        { time: "9:00-10:30", subject: "", room: "" },
        { time: "10:40-12:10", subject: "", room: "" },
        { time: "13:20-14:50", subject: "Математический анализ", room: "2А5" },
        { time: "15:00-16:30", subject: "Математический анализ", room: "2А5" },
        { time: "16:40-18:10", subject: "", room: "" }
    ],
    "07/10/2024": [
        { time: "9:00-10:30", subject: "Операционные системы", room: "1С2" },
        { time: "10:40-12:10", subject: "Операционные системы", room: "1С2" },
        { time: "13:20-14:50", subject: "Математический анализ", room: "2А2" },
        { time: "15:00-16:30", subject: "Математический анализ", room: "2А2" },
        { time: "16:40-18:10", subject: "", room: "" }
    ],
    "08/10/2024": [
        { time: "9:00-10:30", subject: "Операционные системы", room: "1С2" },
        { time: "10:40-12:10", subject: "Операционные системы", room: "1С2" },
        { time: "13:20-14:50", subject: "Операционные системы", room: "1С2" },
        { time: "15:00-16:30", subject: "Математический анализ", room: "2А2" },
        { time: "16:40-18:10", subject: "", room: "" }
    ],
    "09/10/2024": [
        { time: "9:00-10:30", subject: "Операционные системы", room: "1С2" },
        { time: "10:40-12:10", subject: "Операционные системы", room: "1С2" },
        { time: "13:20-14:50", subject: "Операционные системы", room: "1С2" },
        { time: "15:00-16:30", subject: "", room: "" },
        { time: "16:40-18:10", subject: "", room: "" }
    ],
    "10/10/2024": [
        { time: "9:00-10:30", subject: "Операционные системы", room: "1С2" },
        { time: "10:40-12:10", subject: "Операционные системы", room: "1С2" },
        { time: "13:20-14:50", subject: "Операционные системы", room: "1С2" },
        { time: "15:00-16:30", subject: "", room: "" },
        { time: "16:40-18:10", subject: "", room: "" }
    ],
    "11/10/2024": [
        { time: "9:00-10:30", subject: "Операционные системы", room: "1С2" },
        { time: "10:40-12:10", subject: "Операционные системы", room: "1С2" },
        { time: "13:20-14:50", subject: "Математический анализ", room: "2А2" },
        { time: "15:00-16:30", subject: "Математический анализ", room: "2А2" },
        { time: "16:40-18:10", subject: "", room: "" }
    ],
    "12/10/2024": [
        { time: "9:00-10:30", subject: "Операционные системы", room: "1С2" },
        { time: "10:40-12:10", subject: "Операционные системы", room: "1С2" },
        { time: "13:20-14:50", subject: "Математический анализ", room: "2А2" },
        { time: "15:00-16:30", subject: "Математический анализ", room: "2А2" },
        { time: "16:40-18:10", subject: "", room: "" }
    ],
    "14/10/2024": [
        { time: "9:00-10:30", subject: "Операционные системы", room: "1С2" },
        { time: "10:40-12:10", subject: "Операционные системы", room: "1С2" },
        { time: "13:20-14:50", subject: "Математический анализ", room: "2А2" },
        { time: "15:00-16:30", subject: "Математический анализ", room: "2А2" },
        { time: "16:40-18:10", subject: "", room: "" }
    ],
    "15/10/2024": [
        { time: "9:00-10:30", subject: "Операционные системы", room: "1С2" },
        { time: "10:40-12:10", subject: "Операционные системы", room: "1С2" },
        { time: "13:20-14:50", subject: "Операционные системы", room: "1С2" },
        { time: "15:00-16:30", subject: "Математический анализ", room: "2А2" },
        { time: "16:40-18:10", subject: "", room: "" }
    ],
    "16/10/2024": [
        { time: "9:00-10:30", subject: "Операционные системы", room: "1С2" },
        { time: "10:40-12:10", subject: "Операционные системы", room: "1С2" },
        { time: "13:20-14:50", subject: "Операционные системы", room: "1С2" },
        { time: "15:00-16:30", subject: "Математический анализ", room: "2А2" },
        { time: "16:40-18:10", subject: "", room: "" }
    ],
    "17/10/2024": [
        { time: "9:00-10:30", subject: "Операционные системы", room: "1С2" },
        { time: "10:40-12:10", subject: "Операционные системы", room: "1С2" },
        { time: "13:20-14:50", subject: "Операционные системы", room: "1С2" },
        { time: "15:00-16:30", subject: "Математический анализ", room: "2А2" },
        { time: "16:40-18:10", subject: "", room: "" }
    ],
    "18/10/2024": [
        { time: "9:00-10:30", subject: "Математический анализ", room: "2А2" },
        { time: "10:40-12:10", subject: "Операционные системы", room: "1С2" },
        { time: "13:20-14:50", subject: "Операционные системы", room: "1С2" },
        { time: "15:00-16:30", subject: "Иностранный язык", room: "2А4, 2С2" },
        { time: "16:40-18:10", subject: "", room: "" }
    ],
    "19/10/2024": [
        { time: "9:00-10:30", subject: "Операционные системы", room: "1С2" },
        { time: "10:40-12:10", subject: "Операционные системы", room: "1С2" },
        { time: "13:20-14:50", subject: "Математический анализ", room: "2А2" },
        { time: "15:00-16:30", subject: "Математический анализ", room: "2А2" },
        { time: "16:40-18:10", subject: "", room: "" }
    ],
    "21/10/2024": [
        { time: "9:00-10:30", subject: "", room: "" },
        { time: "10:40-12:10", subject: "Физкультура", room: "" },
        { time: "13:20-14:50", subject: "Практикум на ЭВМ", room: "1С2" },
        { time: "15:00-16:30", subject: "", room: "" },
        { time: "16:40-18:10", subject: "", room: "" }
    ],
    "22/10/2024": [
        { time: "9:00-10:30", subject: "", room: "" },
        { time: "10:40-12:10", subject: "", room: "" },
        { time: "13:20-14:50", subject: "Операционные системы", room: "1С2" },
        { time: "15:00-16:30", subject: "Практикум на ЭВМ", room: "1С2" },
        { time: "16:40-18:10", subject: "", room: "" }
    ],
    "23/10/2024": [
        { time: "9:00-10:30", subject: "", room: "" },
        { time: "10:40-12:10", subject: "", room: "" },
        { time: "13:20-14:50", subject: "Операционные системы", room: "1С2" },
        { time: "15:00-16:30", subject: "", room: "" },
        { time: "16:40-18:10", subject: "", room: "" }
    ],
    "24/10/2024": [
        { time: "9:00-10:30", subject: "", room: "" },
        { time: "10:40-12:10", subject: "", room: "" },
        { time: "13:20-14:50", subject: "Операционные системы", room: "1С2" },
        { time: "15:00-16:30", subject: "Практикум на ЭВМ", room: "1С2" },
        { time: "16:40-18:10", subject: "", room: "" }
    ],
    "25/10/2024": [
        { time: "9:00-10:30", subject: "", room: "" },
        { time: "10:40-12:10", subject: "Физкультура", room: "" },
        { time: "13:20-14:50", subject: "Операционные системы", room: "1С2" },
        { time: "15:00-16:30", subject: "", room: "" },
        { time: "16:40-18:10", subject: "", room: "" }
    ],
    "26/10/2024": [
        { time: "9:00-10:30", subject: "", room: "" },
        { time: "10:40-12:10", subject: "", room: "" },
        { time: "13:20-14:50", subject: "Операционные системы", room: "1С2" },
        { time: "15:00-16:30", subject: "Практикум на ЭВМ", room: "1С2" },
        { time: "16:40-18:10", subject: "", room: "" }
    ],
    "28/10/2024": [
        { time: "9:00-10:30", subject: "", room: "" },
        { time: "10:40-12:10", subject: "", room: "" },
        { time: "13:20-14:50", subject: "Операционные системы", room: "1С2" },
        { time: "15:00-16:30", subject: "", room: "" },
        { time: "16:40-18:10", subject: "", room: "" }
    ],
    "29/10/2024": [
        { time: "9:00-10:30", subject: "", room: "" },
        { time: "10:40-12:10", subject: "Операционные системы", room: "1С2" },
        { time: "13:20-14:50", subject: "Практикум на ЭВМ", room: "1С2" },
        { time: "15:00-16:30", subject: "", room: "" },
        { time: "16:40-18:10", subject: "", room: "" }
    ],
    "30/10/2024": [
        { time: "9:00-10:30", subject: "", room: "" },
        { time: "10:40-12:10", subject: "", room: "" },
        { time: "13:20-14:50", subject: "Операционные системы", room: "1С2" },
        { time: "15:00-16:30", subject: "", room: "" },
        { time: "16:40-18:10", subject: "", room: "" }
    ],
    "31/10/2024": [
        { time: "9:00-10:30", subject: "", room: "" },
        { time: "10:40-12:10", subject: "Операционные системы", room: "1С2" },
        { time: "13:20-14:50", subject: "Практикум на ЭВМ", room: "1С2" },
        { time: "15:00-16:30", subject: "", room: "" },
        { time: "16:40-18:10", subject: "", room: "" }
    ]
};